app/controllers/articles_controller.rb

SELECT * FROM `articles` WHERE (`articles`.`id` = 2)
SELECT * FROM `cities` WHERE (`cities`.`id` = 1)
---
  def edit
    @article = Article.find(params[:id])
    @cities = City.find(:all)

INSERT INTO `articles` (`name`, `created_at`, `updated_at`, `lng`, `content`, `city_id`, `lat`) VALUES(NULL, '2009-02-10 13:28:10', '2009-02-10 13:28:10', NULL, NULL, NULL, NULL)
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT * FROM `articles` WHERE (`articles`.`id` = 2)
UPDATE `articles` SET `content` = '<object width=\"425\" height=\"344\"><param name=\"movie\" value=\"http://www.youtube.com/v/InCiE1AXc0o&hl=en&fs=1\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://www.youtube.com/v/InCiE1AXc0o&hl=en&fs=1\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"425\" height=\"344\"></embed></object>', `updated_at` = '2009-02-16 15:51:29', `name` = 'Second Life' WHERE `id` = 3
---
  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])