app/controllers/cities_controller.rb

SELECT * FROM `cities` WHERE (name = 'stockholm') LIMIT 1
---
  def show
    if params[:id] != nil
      city = City.find(:first,:conditions => ["name = ?", params[:id]])

SELECT * FROM `articles` WHERE (`articles`.city_id = 1)
---
    #  @map.overlay_init(source)

      # create markers one for each location found
      articles = city.articles.find(:all)

SELECT * FROM `cities` WHERE (`cities`.`id` = 1)
---
  def edit
    @city = City.find(params[:id])

INSERT INTO `cities` (`name`, `created_at`, `updated_at`, `lng`, `lat`) VALUES('Stockholm', '2009-02-10 09:59:51', '2009-02-10 09:59:51', 18.0656433105469, 59.3322875993558)
---
  def create
    @city = City.new(params[:city])

    respond_to do |format|
      if @city.save

SELECT * FROM `cities` WHERE (`cities`.`id` = 2)
UPDATE `cities` SET `updated_at` = '2009-02-10 12:22:06', `lat` = 12.9700749846468, `lng` = 77.5940322875977 WHERE `id` = 2
---
  def update
    @city = City.find(params[:id])

    respond_to do |format|
      if @city.update_attributes(params[:city])